In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
ssData = './SampleSubmission.csv'
trainData = './Train.csv'
testData = './Test.csv'
vdData = './VariableDefinitions.csv'

In [3]:
train = pd.read_csv(trainData)

In [4]:
train.head()

,VehicleID,Location,Maker,Model,Year,Colour,Amount (Million Naira),Type,Distance
0,VHL12546,Abuja,Honda,Accord Coupe EX V-6,"2,011",Silver,2.2,Nigerian Used,NaN
1,VHL18827,Ibadan,Hyundai,Sonata,"2,012",Silver,3.5,Nigerian Used,"125,000"
2,VHL19499,Lagos,Lexus,RX 350,"2,010",Red,9.2,Foreign Used,"110,852"
3,VHL17991,Abuja,Mercedes-Benz,GLE-Class,"2,017",Blue,22.8,Foreign Used,"30,000"
4,VHL12170,Ibadan,Toyota,Highlander,"2,002",Red,2.6,Nigerian Used,"125,206"

In [5]:
test = pd.read_csv(testData)

In [6]:
test.head()

,VehicleID,Location,Maker,Model,Year,Colour,Type,Distance
0,VHL18518,Abuja,BMW,323i,"2,008",White,Foreign Used,30524.0
1,VHL17149,Lagos,Toyota,Camry,"2,013",White,Foreign Used,NaN
2,VHL10927,Lagos,Toyota,Highlander Limited V6,"2,005",Gold,Foreign Used,NaN
3,VHL12909,Lagos,Toyota,Camry,"2,011",Gray,Foreign Used,166839.0
4,VHL12348,Lagos,Lexus,ES 350 FWD,"2,013",Red,Foreign Used,88862.0

In [7]:
train.shape, test.shape

((7205, 9), (2061, 8))

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7205 entries, 0 to 7204
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   VehicleID               7205 non-null   object
 1   Location                7205 non-null   object
 2   Maker                   7205 non-null   object
 3   Model                   7205 non-null   object
 4   Year                    7184 non-null   object
 5   Colour                  7205 non-null   object
 6   Amount (Million Naira)  7188 non-null   float64
 7   Type                    7008 non-null   object
 8   Distance                4845 non-null   object
dtypes: float64(1), object(8)
memory usage: 506.7+ KB

In [9]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2061 entries, 0 to 2060
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   VehicleID  2061 non-null   object
 1   Location   2061 non-null   object
 2   Maker      2061 non-null   object
 3   Model      2061 non-null   object
 4   Year       2059 non-null   object
 5   Colour     2061 non-null   object
 6   Type       2007 non-null   object
 7   Distance   1385 non-null   float64
dtypes: float64(1), object(7)
memory usage: 128.9+ KB

In [10]:
# Adding the source column to both train and test to identify them
train['source'] = 'train'
test['source'] = 'test'

In [11]:
train.head()

,VehicleID,Location,Maker,Model,Year,Colour,Amount (Million Naira),Type,Distance,source
0,VHL12546,Abuja,Honda,Accord Coupe EX V-6,"2,011",Silver,2.2,Nigerian Used,NaN,train
1,VHL18827,Ibadan,Hyundai,Sonata,"2,012",Silver,3.5,Nigerian Used,"125,000",train
2,VHL19499,Lagos,Lexus,RX 350,"2,010",Red,9.2,Foreign Used,"110,852",train
3,VHL17991,Abuja,Mercedes-Benz,GLE-Class,"2,017",Blue,22.8,Foreign Used,"30,000",train
4,VHL12170,Ibadan,Toyota,Highlander,"2,002",Red,2.6,Nigerian Used,"125,206",train

In [12]:
test.head()

,VehicleID,Location,Maker,Model,Year,Colour,Type,Distance,source
0,VHL18518,Abuja,BMW,323i,"2,008",White,Foreign Used,30524.0,test
1,VHL17149,Lagos,Toyota,Camry,"2,013",White,Foreign Used,NaN,test
2,VHL10927,Lagos,Toyota,Highlander Limited V6,"2,005",Gold,Foreign Used,NaN,test
3,VHL12909,Lagos,Toyota,Camry,"2,011",Gray,Foreign Used,166839.0,test
4,VHL12348,Lagos,Lexus,ES 350 FWD,"2,013",Red,Foreign Used,88862.0,test

In [13]:
df = pd.concat((train, test), ignore_index=True)

In [14]:
df.shape

(9266, 10)

In [15]:
df.describe()

       Amount (Million Naira)
count             7188.000000
mean                11.847999
std                 25.318922
min                  0.450000
25%                  3.500000
50%                  5.650000
75%                 11.662500
max                456.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9266 entries, 0 to 9265
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   VehicleID               9266 non-null   object
 1   Location                9266 non-null   object
 2   Maker                   9266 non-null   object
 3   Model                   9266 non-null   object
 4   Year                    9243 non-null   object
 5   Colour                  9266 non-null   object
 6   Amount (Million Naira)  7188 non-null   float64
 7   Type                    9015 non-null   object
 8   Distance                6230 non-null   object
 9   source                  9266 non-null   object
dtypes: float64(1), object(9)
memory usage: 724.0+ KB

In [17]:
df.isnull().sum()

VehicleID                    0
Location                     0
Maker                        0
Model                        0
Year                        23
Colour                       0
Amount (Million Naira)    2078
Type                       251
Distance                  3036
source                       0
dtype: int64

In [18]:
df.Year.value_counts()

2,008    949
2,010    785
2,013    760
2,007    622
2,011    607
2,012    587
2,014    556
2,009    554
2,015    482
2,006    448
2,017    386
2,005    380
2,016    354
2,018    331
2,004    285
2,020    273
2,019    241
2,021    188
2,003    157
2,002    101
2,001     73
2,000     48
1,999     27
1,998     14
2,022     12
1,997      8
1,986      4
1,992      3
1,995      2
1,993      1
1,991      1
1,996      1
1,979      1
1,982      1
1,989      1
Name: Year, dtype: int64

##### Fill in the year null values with the medians

In [19]:
import datetime as dt

In [20]:
# Filling the NaN values in Year with the mode
df['Year'].fillna("2,008", inplace=True)

In [21]:
df['Year'].isnull().sum()

0

In [25]:
df['Year'] = int(df['Year'].replace(',', ''))

TypeError: cannot convert the series to <class 'int'>

In [23]:
df["Year"]

0       2,011
1       2,012
2       2,010
3       2,017
4       2,002
        ...
9261    2,020
9262    2,011
9263    2,015
9264    2,013
9265    2,009
Name: Year, Length: 9266, dtype: object

In [24]:
df['Year'] = pd.to_datetime(df['Year'], format="%Y")

ValueError: time data '2,011' does not match format '%Y' (match)